EDT.СЭ_Доработки/src/Catalogs/ОбразованиеФизическихЛиц/ОбразованиеФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="93b30f47-6b97-47f5-a24b-4a1707ae9919">
  <name>ОбразованиеФизическихЛиц</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="b9d6aae2-2811-4814-9cff-1f88c42e8a06">
    <name>СЭ_МолодойСпециалист</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f499ad5d-4a2e-45b8-9340-50d0a8685403">
    <name>СЭ_ДатаНачалаСтатуса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6264e436-676e-4f08-a00e-a6cd92e48c0e">
    <name>СЭ_ДатаОкончанияСтатуса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

EDT.СЭ_Доработки/src/Catalogs/ОбразованиеФизическихЛиц/Forms/ФормаЭлемента/Module.bsl
&НаСервере
&После("ПриСозданииНаСервере")
Процедура СЭ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СЭ_СоздатьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура СЭ_СоздатьЭлементыФормы()

	//СЭ+ Евгений [16498]
	НовГруппа 							= Элементы.Добавить("СЭ_ГруппаМолодойСпециалист", Тип("ГруппаФормы"), ЭтаФорма);
	НовГруппа.Вид 						= ВидГруппыФормы.ОбычнаяГруппа;
	НовГруппа.Отображение 				= ОтображениеОбычнойГруппы.Нет;
	НовГруппа.ОтображатьЗаголовок 		= Ложь;
	НовГруппа.Группировка 				= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;

	нЭлемент = Элементы.Вставить("СЭ_МолодойСпециалист", Тип("ПолеФормы"), НовГруппа); 
	нЭлемент.Вид = ВидПоляФормы.ПолеФлажка; 
	нЭлемент.ПутьКДанным = "Объект.СЭ_МолодойСпециалист";
	нЭлемент.УстановитьДействие("ПриИзменении", "СЭ_МолодойСпециалистПриИзменении");
	
	нЭлемент = Элементы.Вставить("СЭ_ДатаНачалаСтатуса", Тип("ПолеФормы"), НовГруппа); 
	нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	нЭлемент.ПутьКДанным = "Объект.СЭ_ДатаНачалаСтатуса";
	нЭлемент.АвтоОтметкаНезаполненного = ЛОЖЬ; 
	
	нЭлемент = Элементы.Вставить("СЭ_ДатаОкончанияСтатуса", Тип("ПолеФормы"), НовГруппа); 
	нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
	нЭлемент.ПутьКДанным = "Объект.СЭ_ДатаОкончанияСтатуса";
	нЭлемент.АвтоОтметкаНезаполненного = ЛОЖЬ;
	
	СЭ_УстановитьЗависимостиМолодогоСпециалиста();
	//СЭ- Евгений [16498]

КонецПроцедуры

//СЭ+ Евгений [16498]
&НаКлиенте
Процедура СЭ_МолодойСпециалистПриИзменении(Элемент)
	
	СЭ_УстановитьЗависимостиМолодогоСпециалиста();		

КонецПроцедуры 

&НаСервере
Процедура СЭ_УстановитьЗависимостиМолодогоСпециалиста()
	
	Если Объект.ВидОбразования = ПредопределенноеЗначение("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеРБ") Тогда
		Элементы.СЭ_МолодойСпециалист.ТолькоПросмотр = Ложь;
	Иначе
		Объект.СЭ_МолодойСпециалист = Ложь;	
		Элементы.СЭ_МолодойСпециалист.ТолькоПросмотр = Истина;			
	КонецЕсли;
		
	Если НЕ Объект.СЭ_МолодойСпециалист Тогда
		Объект.СЭ_ДатаНачалаСтатуса 	= Неопределено;
		Объект.СЭ_ДатаОкончанияСтатуса 	= Неопределено;
	КонецЕсли;

	Элементы.СЭ_ДатаНачалаСтатуса.ТолькоПросмотр	= НЕ Объект.СЭ_МолодойСпециалист; 
	Элементы.СЭ_ДатаОкончанияСтатуса.ТолькоПросмотр = НЕ Объект.СЭ_МолодойСпециалист;
	
КонецПроцедуры


&НаКлиенте
&После("ВидОбразованияПриИзменении")
Процедура СЭ_ВидОбразованияПриИзменении(Элемент)
	
	СЭ_УстановитьЗависимостиМолодогоСпециалиста();
	
КонецПроцедуры
//СЭ- Евгений [16498]
